a_dict ={'종목명' : '섬광글라스', '등락율(%)': 0.0, '고가대비(%)':-0.97,
          '보유수량':0,'현재가': 41050, '(최우선)매도호가': 41050}

# print(type(a_dict))
# <
# class 'dict'>

# print(len(a_dict))

# print(a_dict.keys())
#
# dict_keys(['종목명', '등락율(%)', '고가대비(%)', '보유수량', '현재가', '(최우선)매도호가'])

# print("키 : %s, 값: %s" % ('종목명', a_dict.get('종목명')))
#
# 키 : 종목명, 값: 섬광글라스

# print("키 : %s, 값: %s" % ('종목명', a_dict['종목명']))
# 키 : 종목명, 값: 섬광글라스

# for key in a_dict.keys():
#     print(key)
#     print(a_dict[key])
# 종목명
# 섬광글라스
# 등락율(%)
# 0.0
# 고가대비(%)
# -0.97
# 보유수량
# 0
# 현재가
# 41050
# (최우선)매도호가
# 41050



